<?php
/**
 * Created by PhpStorm.
 * User: EDZ
 * Date: 2019/3/5
 * Time: 10:52
 */

// +----------------------------------------------------------------------
// | 错误码设置
// | 1 系统错误
// | 2 应用错误
// | 3 权限错误
// +----------------------------------------------------------------------

return [
    '10001' => '系统错误',
    '10101' => '数据库服务错误',

    '20001' => 'token无效',
    '20002' => '签名不正确',
    '20003' => 'access_token已过期',
    '20004' => 'token尚未启用',
    '20005' => '参数验证失败',
    '20006' => 'refresh_token已过期',

    '20101' => '参数不存在或为空',
    '20102' => '订单不存在',
    '20103' => '订单已支付,请勿重复支付',
    '20104' => '缴费基数不在范围内',
    '20105' => '连接第三方服务失败',

    '20201' => '用户名或者密码不能为空',
    '20202' => '验证码错误',
    '20203' => '手机验证码错误',
    '20204' => '两次密码输入不一致',
    '20205' => '用户名格式不正确',

    '20301' => '参数不存在或为空',
    '20302' => '商品不存在或已下架',
    '20303' => '商品已售罄',

    '20401' => '优惠券不存在或已过期',
];